# Создать переменную 'Anna loves music! She plays the piano very well! Look!'
# Программа должна разделить предложения. Не потеряйте восклицательный знак!

a = 'Anna loves music! She plays the piano very well! Look!'
print('___________________________________________________________')

print(a)
print('___________________________________________________________')

print(a.split())
print('___________________________________________________________')

y = enumerate(a)
print(list(y))


