# Создать переменные "love" и "python".
# Программа должна находить сумму индексов букв 'o' в этих переменных.

a = 'love'
b = 'python'

first_word = (a.index('o'))
print('Индекс буквы "o" в первом слове равен', first_word)

second_word = (b.index('o'))
print('Индекс буквы "o" во втором слове равен', second_word)

sum_index = first_word + second_word
print('Сумма индексов буквы "о" в словах равен', sum_index)

