# Создать 2 списка чисел до 100:
# 1. Делятся на 10
# 2. Делятся на 3
import random
ls1 = list(range(10, 101, 10))
print(ls1)

ls2 = list(range(3, 101, 3))
print(ls2)


