# Вход: строка. Программа проверяет есть ли в строке буква ‘f’.
# Если буква встречается только 1 раз: вывести ее индекс. Если два раза и более: вывести
# индексы ее первого и последнего появлений. Если буквы нет, то ничего не надо делать.

str1 = str(input('Введите строку: '))
letter = 'f'
if letter in str1:
    if str1.count(letter) == 1:
        print('Буква "" встречается 1 раз. Её индекс:', str1.index(letter))
    elif str1.count(letter) > 1:
        print('Буква "f" встречается 2 и больше раза. Индексы первой и последней буквы "f":', str1.index(letter), str1.rindex(letter))
else:
    print('Буквы "f" в строке нет.')


