# Вход: длина 3х отрезков. Программа определяет можно
# ли из них составить треугольник, при условии, что у треугольника сумма любых
# двух сторон должна быть НЕ меньше третьей и выводит соответствующее собщение.

len1 = int(input('Введите длину 1: '))
len2 = int(input('Введите длину 2: '))
len3 = int(input('Введите длину 3: '))

if len1 > 0 and len2 > 0 and len3 > 0:
    if len1 + len2 >= len3:
        if len1 + len2 == len3:
            print('Сумма отрезков 1 и 2 равны отрезку 3. Можно из них составить треугольник.')
        elif len1 + len2 > len3:
            print('Сумма отрезков 1 и 2 больше отрезка 3. Можно из них составить треугольник.')
    elif len1 + len3 >= len2:
        if len1 + len3 == len2:
            print('Сумма отрезков 1 и 3 равны отрезку 2. Можно из них составить треугольник.')
        elif len1 + len3 > len2:
            print('Сумма отрезков 1 и 3 больше отрезка 2. Можно из них составить треугольник.')
    elif len2 + len3 >= len1:
        if len2 + len3 == len2:
            print('Сумма отрезков 2 и 3 равны отрезку 1. Можно из них составить треугольник.')
        elif len2 + len3 > len2:
            print('Сумма отрезков 2 и 3 больше отрезка 1. Можно из них составить треугольник.')

else:
    print('Введенные данные неправельные.')
