# Вход: координаты точки. Программа определяет к какой координатной
# четверти принадлежит точка и выводит соответствующее сообщение.

x, y = int(input('Введите координаты X: ')), int(input('Введите координаты Y: '))
print('X =', x, 'Y =', y)
if x != 0 and y != 0:
    if x > 0 and y > 0:
        print('Координаты в первой четверти.')
    elif x < 0 and y < 0:
        print('Координаты в третьей четверти.')
    elif x < 0 and y > 0:
        print('Координаты во второй четверти .')
    elif x > 0 and y < 0:
        print('Координаты в четверой четверти .')
elif x > 0 or x < 0 and y == 0:
    print('Точка лежит на оси X')
elif y > 0 or y < 0 and x == 0:
    print('Точка лежит на оси Y')
else:
    print('Точка лежит в центре координат.')



