# Определите индекс
# наибольшего элемента
# последовательности,
# завершающейся числом 0.
# Если таких элементов
# несколько, то выведите
# индекс первого из них

num = [1]
a = 0

while a != str(0):
    a += 1
print(num.index())
