# На вход программа получает несколько чисел.
# Создать кортеж из чисел, кратных 3м.
nums = tuple(input('Введите несколько чисел через пробел: ').split())
print('Кортеж из первых 3 чисел', nums[0:3])



