# Создайте кортеж с буквами. Посчитайте сколько гласных и выведите на экран в
# формате: «Буква а в кортеже встречается 1 раз»

tpl = tuple(input('Введите несколько букв через пробел: ').split())
vowels = 0
lsv = []

for letter in tpl:
    if letter.isalpha():
        if letter.lower() in 'aeiouy':
            vowels += 1
            lsv.append(letter)

print(vowels, 'Гласных букв в кортеже:', '-->', tpl)
print('Буква "а" в кортеже встречается', lsv.count('a'), 'раз')
print('Буква "e" в кортеже встречается', lsv.count('e'), 'раз')
print('Буква "i" в кортеже встречается', lsv.count('i'), 'раз')
print('Буква "o" в кортеже встречается', lsv.count('o'), 'раз')
print('Буква "u" в кортеже встречается', lsv.count('u'), 'раз')
print('Буква "y" в кортеже встречается', lsv.count('y'), 'раз')


# думаю, есть способ легче, я не додумался(

