print('Задача №2, Программа, которая производит все математические действия, доступные в Python, с введенными числами')

a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))

# Сложение
x1 = a + b
print('Сумма чисел равна:', x1)

# Вычитание
x2 = a - b
print('Разность чисел равна:', x2)

# Умножение
x3 = a * b
print('Производное чисел равна:', x3)

# Деление
x4 = a / b
print('Частное чисел равно:', x4)

# Остаток от деления
x5 = a % b
print('Остаток от деление чисел равен:', x5)

# Возведение в степень
x6 = a*a, b*b
print('Возведение в степень чисел равно:', x6)

# Целочисленное деление
x7 = a // b
print('Целочисленное чисел равно:', x7)
