# Создать список из чисел от 0 до 10. Программа создает новый список, состоящий из
# минимального, максимального элементов и суммы чисел первого списка.
# *Попробуйте сделать в 3 строки кода, включая print().

ls = list(range(0, 11))
ls = min(ls), max(ls), sum(ls)
print(list(ls))
